In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import string
# from unidecode import unidecode # For replacing non-english characters
from nltk.corpus import stopwords
from nltk import word_tokenize
STOPWORDS = set(stopwords.words('english'))
import re
from collections import Counter

In [2]:
pd.set_option('display.max_rows', None)

# Step 1: Read and display the script and character data

In [9]:
harry_potter1_df = pd.read_csv('../Data/harry_potter/Harry Potter 1.csv')
harry_potter2_df = pd.read_csv('../Data/harry_potter/Harry Potter 2.csv')
harry_potter3_df = pd.read_csv('../Data/harry_potter/Harry Potter 3.csv')

In [23]:
print(f"Harry Potter 1 shape: {harry_potter1_df.shape}")
print(f"Harry Potter 2 shape: {harry_potter2_df.shape}")
print(f"Harry Potter 3 shape: {harry_potter3_df.shape}")

Harry Potter 1 shape: (1519, 2)
Harry Potter 2 shape: (1519, 2)
Harry Potter 3 shape: (1519, 2)

In [10]:
harry_potter1_df.head()

,Character,Sentence,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Dumbledore,I should've known that you would be here,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,McGonagall,Good evening,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,McGonagall,Are the rumors true,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Dumbledore,I'm afraid so,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Dumbledore,The good and the bad.,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
harry_potter2_df.head()

,Character,Sentence,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,HARRY,I can’t let you out,NaN,NaN,NaN,NaN,NaN
1,HARRY,I’m not allowed to use magic outside of school.,NaN,NaN,NaN,NaN,NaN
2,HARRY,Besides,NaN,NaN,NaN,NaN,NaN
3,VERNON,Harry Potter!,NaN,NaN,NaN,NaN,NaN
4,HARRY,Now you’ve done it.,NaN,NaN,NaN,NaN,NaN

In [13]:
harry_potter3_df.head()

,CHARACTER,SENTENCE,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,HARRY,Lumos Maxima...,NaN,NaN,NaN,NaN,NaN,NaN
1,HARRY,Lumos Maxima...,NaN,NaN,NaN,NaN,NaN,NaN
2,HARRY,Lumos Maxima...,NaN,NaN,NaN,NaN,NaN,NaN
3,HARRY,Lumos... MAXIMA!,NaN,NaN,NaN,NaN,NaN,NaN
4,AUNT PETUNIA,Harry! Harry!,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
harry_potter1_df.columns

Index(['Character', 'Sentence', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8'],
      dtype='object')

In [17]:
# Get rid of garbage columns
cols_to_keep = ['Character', 'Sentence']
harry_potter1_df = harry_potter1_df[cols_to_keep]
harry_potter2_df = harry_potter1_df[cols_to_keep]
harry_potter3_df = harry_potter1_df[cols_to_keep]

In [18]:
harry_potter1_df.head()

    Character                                  Sentence
0  Dumbledore  I should've known that you would be here
1  McGonagall                              Good evening
2  McGonagall                       Are the rumors true
3  Dumbledore                             I'm afraid so
4  Dumbledore                     The good and the bad.

In [25]:
harry_potter1_df.describe()

       Character Sentence
count       1517     1516
unique        91     1344
top        Harry       Oh
freq         151       26

In [26]:
harry_potter2_df.describe()

       Character Sentence
count       1517     1516
unique        91     1344
top        Harry       Oh
freq         151       26

In [27]:
harry_potter3_df.describe()

       Character Sentence
count       1517     1516
unique        91     1344
top        Harry       Oh
freq         151       26

# Step 2: Look at distinct values of character column for each movie

In [28]:
harry_potter1_df = harry_potter1_df.astype(str)
harry_potter2_df = harry_potter2_df.astype(str)
harry_potter3_df = harry_potter3_df.astype(str)

In [32]:
def get_char_stats(df, film):
    print(f"We have {len(df.Character.unique())} characters as follows for Harry Potter {film}:\n {df.Character.unique()}")

In [33]:
get_char_stats(harry_potter1_df,1)

We have 92 characters as follows for Harry Potter1:
 ['Dumbledore' 'McGonagall' 'Hagrid' 'Petunia' 'Dudley' 'Vernon' 'Harry'
 'Snake' 'Someone' ' either an owl' 'Barkeep\xa0Tom' 'Man' 'Witch'
 'Quirrell' 'Boy' 'Goblin' 'Griphook' 'Ollivander' 'Trainmaster'
 'Mrs. Weasley' 'George' 'Fred' 'Ginny' 'Ron' 'Woman' 'Hermione' 'Neville'
 'Malfoy' 'Whispers' 'Sorting Hat' 'Seamus' 'Percy' 'Sir Nicholas' 'Girl'
 'Man in paint' 'Fat Lady' 'Snape' 'Dean' 'nan' 'Madam Hooch' 'Class'
 'Harry ' 'Fred  ' 'Ron  ' 'George  ' 'Harry  ' 'Hermione  ' 'Ron '
 'Hermione ' 'Filch' 'All  ' 'Oliver ' 'Oliver  ' 'Flitwick' 'Draco  '
 'Flitwick  ' 'Seamus  ' 'Girl  ' 'Boy  ' 'Percy  ' 'McGonagall '
 'Ron and Harry' 'McGonagall  ' 'Quirrell  ' 'Snape  ' 'OIiver  '
 'Lee Jordan' 'Hagrid ' 'Gryffindors  ' 'Flint  ' 'Crowd  ' 'Flint'
 'Hagrid  ' 'Man  ' 'Lee  Jordan' 'Madam Hooch ' 'Quirrell ' 'Filch  '
 'Dumbledore  ' 'Hermoine' 'Ron and Harry  ' 'Filch ' 'Firenze  '
 'Firenze ' 'Snape ' 'Neville  ' 'Ron   ' 'Voldemort ' 'Voldemort'
 'Voldemort  ' 'Dumbledore ' 'Students']

In [34]:
get_char_stats(harry_potter1_df,2)

We have 92 characters as follows for Harry Potter2:
 ['Dumbledore' 'McGonagall' 'Hagrid' 'Petunia' 'Dudley' 'Vernon' 'Harry'
 'Snake' 'Someone' ' either an owl' 'Barkeep\xa0Tom' 'Man' 'Witch'
 'Quirrell' 'Boy' 'Goblin' 'Griphook' 'Ollivander' 'Trainmaster'
 'Mrs. Weasley' 'George' 'Fred' 'Ginny' 'Ron' 'Woman' 'Hermione' 'Neville'
 'Malfoy' 'Whispers' 'Sorting Hat' 'Seamus' 'Percy' 'Sir Nicholas' 'Girl'
 'Man in paint' 'Fat Lady' 'Snape' 'Dean' 'nan' 'Madam Hooch' 'Class'
 'Harry ' 'Fred  ' 'Ron  ' 'George  ' 'Harry  ' 'Hermione  ' 'Ron '
 'Hermione ' 'Filch' 'All  ' 'Oliver ' 'Oliver  ' 'Flitwick' 'Draco  '
 'Flitwick  ' 'Seamus  ' 'Girl  ' 'Boy  ' 'Percy  ' 'McGonagall '
 'Ron and Harry' 'McGonagall  ' 'Quirrell  ' 'Snape  ' 'OIiver  '
 'Lee Jordan' 'Hagrid ' 'Gryffindors  ' 'Flint  ' 'Crowd  ' 'Flint'
 'Hagrid  ' 'Man  ' 'Lee  Jordan' 'Madam Hooch ' 'Quirrell ' 'Filch  '
 'Dumbledore  ' 'Hermoine' 'Ron and Harry  ' 'Filch ' 'Firenze  '
 'Firenze ' 'Snape ' 'Neville  ' 'Ron   ' 'Voldemort ' 'Voldemort'
 'Voldemort  ' 'Dumbledore ' 'Students']

In [35]:
get_char_stats(harry_potter1_df,3)

We have 92 characters as follows for Harry Potter3:
 ['Dumbledore' 'McGonagall' 'Hagrid' 'Petunia' 'Dudley' 'Vernon' 'Harry'
 'Snake' 'Someone' ' either an owl' 'Barkeep\xa0Tom' 'Man' 'Witch'
 'Quirrell' 'Boy' 'Goblin' 'Griphook' 'Ollivander' 'Trainmaster'
 'Mrs. Weasley' 'George' 'Fred' 'Ginny' 'Ron' 'Woman' 'Hermione' 'Neville'
 'Malfoy' 'Whispers' 'Sorting Hat' 'Seamus' 'Percy' 'Sir Nicholas' 'Girl'
 'Man in paint' 'Fat Lady' 'Snape' 'Dean' 'nan' 'Madam Hooch' 'Class'
 'Harry ' 'Fred  ' 'Ron  ' 'George  ' 'Harry  ' 'Hermione  ' 'Ron '
 'Hermione ' 'Filch' 'All  ' 'Oliver ' 'Oliver  ' 'Flitwick' 'Draco  '
 'Flitwick  ' 'Seamus  ' 'Girl  ' 'Boy  ' 'Percy  ' 'McGonagall '
 'Ron and Harry' 'McGonagall  ' 'Quirrell  ' 'Snape  ' 'OIiver  '
 'Lee Jordan' 'Hagrid ' 'Gryffindors  ' 'Flint  ' 'Crowd  ' 'Flint'
 'Hagrid  ' 'Man  ' 'Lee  Jordan' 'Madam Hooch ' 'Quirrell ' 'Filch  '
 'Dumbledore  ' 'Hermoine' 'Ron and Harry  ' 'Filch ' 'Firenze  '
 'Firenze ' 'Snape ' 'Neville  ' 'Ron   ' 'Voldemort ' 'Voldemort'
 'Voldemort  ' 'Dumbledore ' 'Students']

*We notice that cleaning up the values will greatly lower the number of characters

In [36]:
def clean_df(df):
    df.Character = df.Character.str.strip()
    df.Character = df.Character.str.upper()
    return df

In [37]:
harry_potter1_df = clean_df(harry_potter1_df)
harry_potter2_df = clean_df(harry_potter2_df)
harry_potter3_df = clean_df(harry_potter3_df)

In [38]:
get_char_stats(harry_potter1_df,1)

We have 57 characters as follows for Harry Potter1:
 ['DUMBLEDORE' 'MCGONAGALL' 'HAGRID' 'PETUNIA' 'DUDLEY' 'VERNON' 'HARRY'
 'SNAKE' 'SOMEONE' 'EITHER AN OWL' 'BARKEEP\xa0TOM' 'MAN' 'WITCH'
 'QUIRRELL' 'BOY' 'GOBLIN' 'GRIPHOOK' 'OLLIVANDER' 'TRAINMASTER'
 'MRS. WEASLEY' 'GEORGE' 'FRED' 'GINNY' 'RON' 'WOMAN' 'HERMIONE' 'NEVILLE'
 'MALFOY' 'WHISPERS' 'SORTING HAT' 'SEAMUS' 'PERCY' 'SIR NICHOLAS' 'GIRL'
 'MAN IN PAINT' 'FAT LADY' 'SNAPE' 'DEAN' 'NAN' 'MADAM HOOCH' 'CLASS'
 'FILCH' 'ALL' 'OLIVER' 'FLITWICK' 'DRACO' 'RON AND HARRY' 'OIIVER'
 'LEE JORDAN' 'GRYFFINDORS' 'FLINT' 'CROWD' 'LEE  JORDAN' 'HERMOINE'
 'FIRENZE' 'VOLDEMORT' 'STUDENTS']

In [39]:
get_char_stats(harry_potter2_df,2)

We have 57 characters as follows for Harry Potter2:
 ['DUMBLEDORE' 'MCGONAGALL' 'HAGRID' 'PETUNIA' 'DUDLEY' 'VERNON' 'HARRY'
 'SNAKE' 'SOMEONE' 'EITHER AN OWL' 'BARKEEP\xa0TOM' 'MAN' 'WITCH'
 'QUIRRELL' 'BOY' 'GOBLIN' 'GRIPHOOK' 'OLLIVANDER' 'TRAINMASTER'
 'MRS. WEASLEY' 'GEORGE' 'FRED' 'GINNY' 'RON' 'WOMAN' 'HERMIONE' 'NEVILLE'
 'MALFOY' 'WHISPERS' 'SORTING HAT' 'SEAMUS' 'PERCY' 'SIR NICHOLAS' 'GIRL'
 'MAN IN PAINT' 'FAT LADY' 'SNAPE' 'DEAN' 'NAN' 'MADAM HOOCH' 'CLASS'
 'FILCH' 'ALL' 'OLIVER' 'FLITWICK' 'DRACO' 'RON AND HARRY' 'OIIVER'
 'LEE JORDAN' 'GRYFFINDORS' 'FLINT' 'CROWD' 'LEE  JORDAN' 'HERMOINE'
 'FIRENZE' 'VOLDEMORT' 'STUDENTS']

In [40]:
get_char_stats(harry_potter3_df,3)

We have 57 characters as follows for Harry Potter3:
 ['DUMBLEDORE' 'MCGONAGALL' 'HAGRID' 'PETUNIA' 'DUDLEY' 'VERNON' 'HARRY'
 'SNAKE' 'SOMEONE' 'EITHER AN OWL' 'BARKEEP\xa0TOM' 'MAN' 'WITCH'
 'QUIRRELL' 'BOY' 'GOBLIN' 'GRIPHOOK' 'OLLIVANDER' 'TRAINMASTER'
 'MRS. WEASLEY' 'GEORGE' 'FRED' 'GINNY' 'RON' 'WOMAN' 'HERMIONE' 'NEVILLE'
 'MALFOY' 'WHISPERS' 'SORTING HAT' 'SEAMUS' 'PERCY' 'SIR NICHOLAS' 'GIRL'
 'MAN IN PAINT' 'FAT LADY' 'SNAPE' 'DEAN' 'NAN' 'MADAM HOOCH' 'CLASS'
 'FILCH' 'ALL' 'OLIVER' 'FLITWICK' 'DRACO' 'RON AND HARRY' 'OIIVER'
 'LEE JORDAN' 'GRYFFINDORS' 'FLINT' 'CROWD' 'LEE  JORDAN' 'HERMOINE'
 'FIRENZE' 'VOLDEMORT' 'STUDENTS']

In [41]:
def fix_spelling(char):
    if char == 'OIIVER':
        char = 'OLIVER'
    if 'BARKEEP' in char:
        char = 'BARKEEP'
    return char

In [ ]:
harry_potter1_df.Character = harry_potter1_df.Character.apply(fix_spelling)
harry_potter2_df.Character = harry_potter1_df.Character.apply(fix_spelling)
harry_potter3_df.Character = harry_potter1_df.Character.apply(fix_spelling)